124 - Use mermaid for project process diagram (#166)
